package chap4_array;

public class 실습_4_3_2차원행렬더하기 {
	public static void main(String[] args) {
        // 두 개의 2차원 배열 생성 및 초기화
		/*
		 * 행렬 [3][4] A, B를 정수로 선언하고 12개의 값을 초기화
		 */

		int matrix[3][4] = A;

        // 결과를 저장할 2차원 배열
		/*
		 * C = A + B => 행렬 A와 B를 더하여 C에 넣기 위한 정수 배열 C를 선언
		 */

        // 행렬 더하기
		/*
		 * A, B를 더한 결과를 저장하는 C를 구하는 for 문 구현
		 */


        // 결과 출력
		/*
		 * 행렬 A, B, C를 출력하는 코드 작성
		 * 출력 형태는 
		 * "A = 
		 *      1,2,3,4,5,6,7
		 *      8,9, ...
		 *  B = 
		 *  
		 *  C = 
		 */
    }
}
